## Plan Result (Dev - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 6 to destroy.</code></pre>

* Replace
  * module.casetracker.azurerm_role_assignment.dnszonecontributer
  * module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer
  * module.courtfines.azurerm_role_assignment.dnszonecontributer
  * module.dev.azurerm_role_assignment.dnszonecontributer
  * module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer
  * module.public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.casetracker.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.casetracker.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/5f92a4be-12d7-ab17-49c9-6617f403edf1" -> (known after apply)
      ~ name                                   = "5f92a4be-12d7-ab17-49c9-6617f403edf1" -> (known after apply)
      ~ principal_id                           = "a02b18e4-fba7-4d7d-9603-07e128f4126a" -> "/groups/a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.certificatedbailiffs.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/b14eb5cb-10b8-cd2a-cce5-99be029625a1" -> (known after apply)
      ~ name                                   = "b14eb5cb-10b8-cd2a-cce5-99be029625a1" -> (known after apply)
      ~ principal_id                           = "a02b18e4-fba7-4d7d-9603-07e128f4126a" -> "/groups/a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.courtfines.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.courtfines.direct.gov.uk/providers/Microsoft.Authorization/roleAssignments/bf30e6b0-1174-3bec-9685-323f32bd0709" -> (known after apply)
      ~ name                                   = "bf30e6b0-1174-3bec-9685-323f32bd0709" -> (known after apply)
      ~ principal_id                           = "a02b18e4-fba7-4d7d-9603-07e128f4126a" -> "/groups/a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.dev.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/a8a888ac-6b0f-f7c1-7915-8dde64a84f47" -> (known after apply)
      ~ name                                   = "a8a888ac-6b0f-f7c1-7915-8dde64a84f47" -> (known after apply)
      ~ principal_id                           = "a02b18e4-fba7-4d7d-9603-07e128f4126a" -> "/groups/a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/dev.immigrationappealsonline.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/d983d746-a43b-0d10-b350-dcc49b4279d2" -> (known after apply)
      ~ name                                   = "d983d746-a43b-0d10-b350-dcc49b4279d2" -> (known after apply)
      ~ principal_id                           = "a02b18e4-fba7-4d7d-9603-07e128f4126a" -> "/groups/a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/preview.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/f09cc4f8-3055-2270-45fc-52504308b78c" -> (known after apply)
      ~ name                                   = "f09cc4f8-3055-2270-45fc-52504308b78c" -> (known after apply)
      ~ principal_id                           = "a02b18e4-fba7-4d7d-9603-07e128f4126a" -> "/groups/a02b18e4-fba7-4d7d-9603-07e128f4126a" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1856,"Program":"tfcmt","SHA1":"","Target":"Dev - TerraformPlanApply","Vars":{}} -->